app/controllers/restaurants_controller.rb

INSERT INTO "restaurants" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "KFC"], ["created_at", "2016-08-24 10:34:01.973783"], ["updated_at", "2016-08-24 10:34:01.973783"]]
---
  def create
    @restaurant = Restaurant.new(restaurant_params)
    if @restaurant.save

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 4]]
UPDATE "restaurants" SET "name" = $1, "updated_at" = $2 WHERE "restaurants"."id" = $3  [["name", "Kentucky Fried Chicken"], ["updated_at", "2016-08-24 10:34:02.076019"], ["id", 4]]
---
  def update
    @restaurant = Restaurant.find(params[:id])
    @restaurant.update(restaurant_params)

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 5]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = $1  [["id", 5]]
---
  def destroy
    @restaurant = Restaurant.find(params[:id])
    @restaurant.delete